# St7SetSolverScheme

Sets the scheme to be used for the solution of the linear system arising from the finite element model.

long St7SetSolverScheme(long uID, long Scheme)

Input Parameters

uID

Strand7 model file ID.

Scheme

One of stSkyline, stSparse or stIterativePCG.